       IDENTIFICATION DIVISION.
       PROGRAM-ID. TP2.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-PRIX-HT PIC 9(9)V99.
       01 WS-TAUX-TVA PIC 9(2)V99 VALUE 0.20.
       01 WS-COUT-TVA PIC 9(9)V99.
       01 WS-PRIX-TVA PIC 9(9)V99.
       01 WS-IMP PIC X(30).
       PROCEDURE DIVISION.
           DISPLAY "PRIX HT : " WITH NO ADVANCING.
           ACCEPT WS-IMP.
           MOVE FUNCTION NUMVAL(WS-IMP) TO WS-PRIX-HT.
           COMPUTE WS-COUT-TVA ROUNDED = WS-PRIX-HT * WS-TAUX-TVA.
           DISPLAY "TVA (20%) : " WS-COUT-TVA.
           COMPUTE WS-PRIX-TVA ROUNDED = WS-PRIX-HT + WS-COUT-TVA.
           DISPLAY "PRIX TTC : " WS-PRIX-TVA.
           STOP RUN.
